src/Documents/ОплатаАренды/ОплатаАренды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОплатаАренды</name>
  <registerRecords>AccumulationRegister.СтатистикаПользователей</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Скидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяАренды</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тариф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

src/InformationRegisters/ПрайсПоТарифам/ПрайсПоТарифам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПрайсПоТарифам</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Тариф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТипНоменклатуры</name>
    <type>
      <types>CatalogRef.ТипыНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/ОплатаАренды/Forms/ФормаДокумента/Module.bsl
//@strict-types

&НаКлиенте
Процедура ПересчитатьСумму()
	Объект.СуммаОплаты = Окр(Объект.Тариф * Объект.ВремяАренды * (100 - Объект.Скидка) / 100, 0,
		РежимОкругления.Окр15как10);
	ОбновитьОтображениеДанных();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ПересчитатьСумму();
КонецПроцедуры
&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
	ПользовательПриИзмененииНаСервере();
	ПересчитатьСумму();
КонецПроцедуры

&НаСервере
Процедура ПользовательПриИзмененииНаСервере()
	Объект.Скидка = Объект.Клиент.Статус.Скидка;
КонецПроцедуры

&НаКлиенте
Процедура ТарифПриИзменении(Элемент)
	ПересчитатьСумму();
КонецПроцедуры

&НаКлиенте
Процедура СкидкаПриИзменении(Элемент)
	ПересчитатьСумму();
КонецПроцедуры

&НаКлиенте
Процедура ТоварПриИзменении(Элемент)
	ТоварПриИзмененииНаСервере();
	ПересчитатьСумму();
КонецПроцедуры

&НаКлиенте
Процедура ВремяАрендыПриИзменении(Элемент)
	ПересчитатьСумму();
КонецПроцедуры

&НаСервере
Процедура ТоварПриИзмененииНаСервере()
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПрайсПоТарифам.Тариф
		|ИЗ
		|	РегистрСведений.ПрайсПоТарифам КАК ПрайсПоТарифам
		|ГДЕ
		|	ПрайсПоТарифам.ТипНоменклатуры = &ТипНоменклатуры";
	
	Запрос.УстановитьПараметр("ТипНоменклатуры", Объект.Товар.ТипНоменклатуры);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Значение = ВыборкаДетальныеЗаписи.Тариф; // Число -
		Объект.Тариф = Значение;
	КонецЕсли;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
КонецПроцедуры
